UniqueDroid/KaliberOS/components/hal/boards/watchy_v3/sdkconfig.defaults
# Watchy v3: ESP32-S3, 8MB flash, PSRAM on module (verify: quad vs octal!)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
